{
  "rose": {
    "info": "Used for skin care and in cosmetics.",
    "image": "rose.jpg"
  },
  "tulsi": {
    "info": "Used in Ayurveda for its medicinal properties.",
    "image": "tulsi.jpg"
  },
  "aloevera": {
    "info": "Known for its soothing and healing properties.",
    "image": "aloevera.jpg"
  },
  "lavender": {
    "info": "Used in aromatherapy for relaxation and sleep improvement.",
    "image": "lavender.jpg"
  },
  "mint": {
    "info": "Commonly used to aid digestion and relieve headaches.",
    "image": "mint.jpg"
  },
  "chamomile": {
    "info": "Used to promote relaxation and help with sleep.",
    "image": "chamomile.jpg"
  },
  "dandelion": {
    "info": "Used as a diuretic and to aid digestion.",
    "image": "dandelion.jpg"
  },
  "ginger": {
    "info": "Known for its anti-nausea and anti-inflammatory properties.",
    "image": "ginger.jpg"
  },
  "turmeric": {
    "info": "Contains curcumin, which has anti-inflammatory and antioxidant effects.",
    "image": "turmeric.jpg"
  },
  "basil": {
    "info": "Used in cooking and has antibacterial properties.",
    "image": "basil.jpg"
  },
  "parsley": {
    "info": "Rich in vitamins and used for its diuretic properties.",
    "image": "parsley.jpg"
  },
  "thyme": {
    "info": "Has antimicrobial properties and is used in cooking and medicine.",
    "image": "thyme.jpg"
  },
  "rosemary": {
    "info": "Used to improve memory and concentration, and for its antioxidant properties.",
    "image": "rosemary.jpg"
  },
  "sage": {
    "info": "Known for its digestive benefits and antimicrobial properties.",
    "image": "sage.jpg"
  },
  "oregano": {
    "info": "Contains antioxidants and is used for its anti-inflammatory effects.",
    "image": "oregano.jpg"
  },
  "coriander": {
    "info": "Used for its antioxidant and digestive benefits.",
    "image": "coriander.jpg"
  },
  "fennel": {
    "info": "Known for its digestive benefits and ability to reduce bloating.",
    "image": "fennel.jpg"
  },
  "jasmine": {
    "info": "Used in aromatherapy for its calming effects and to reduce stress.",
    "image": "jasmine.jpg"
  },
  "hibiscus": {
    "info": "Rich in antioxidants and used to lower blood pressure.",
    "image": "hibiscus.jpg"
  },
  "echinacea": {
    "info": "Boosts the immune system and is used to prevent colds.",
    "image": "echinacea.jpg"
  }
}
